SunCity/src/InformationRegisters/КассоваяДисциплинаВыемкиПриЗакрытииСмены/КассоваяДисциплинаВыемкиПриЗакрытииСмены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КассоваяДисциплинаВыемкиПриЗакрытииСмены</name>
  <resources>
    <name>ТипВыемкиПриЗакрытииСмены</name>
    <type>
      <types>EnumRef.ТипыВыемкиПриЗакрытииСмены</types>
    </type>
  </resources>
  <resources>
    <name>МаксимальнаяСуммаРазмена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SunCity/src/Enums/ТипыВыемкиПриЗакрытииСмены/ТипыВыемкиПриЗакрытииСмены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыВыемкиПриЗакрытииСмены</name>
  <enumValues>
    <name>ПроизводитьПолнуюВыемку</name>
  </enumValues>
  <enumValues>
    <name>ОставитьСуммуРазменаВКассеККМ</name>
  </enumValues>
  <enumValues>
    <name>ВыемкуНеПроизводить</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/InformationRegisters/КассоваяДисциплинаВыемкиПриЗакрытииСмены/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияРТ.ПроверитьИспользованиеОрганизации(Отказ,,Запись.Организация);
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") Тогда
		Элементы.Организация.Видимость = Ложь;
	КонецЕсли;
	
	АвтоматическаяВыемка = НЕ Запись.ТипВыемкиПриЗакрытииСмены = Перечисления.ТипыВыемкиПриЗакрытииСмены.ВыемкуНеПроизводить;
	
	УправлениеЭлементамиФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если АвтоматическаяВыемка Тогда
		Если Запись.МаксимальнаяСуммаРазмена > 0 Тогда
			ТекущийОбъект.ТипВыемкиПриЗакрытииСмены = Перечисления.ТипыВыемкиПриЗакрытииСмены.ОставитьСуммуРазменаВКассеККМ;
		Иначе
			ТекущийОбъект.ТипВыемкиПриЗакрытииСмены = Перечисления.ТипыВыемкиПриЗакрытииСмены.ПроизводитьПолнуюВыемку;
		КонецЕсли;
	Иначе
		ТекущийОбъект.ТипВыемкиПриЗакрытииСмены = Перечисления.ТипыВыемкиПриЗакрытииСмены.ВыемкуНеПроизводить;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АвтоматическаяВыемкаПриИзменении(Элемент)
	
	Если НЕ АвтоматическаяВыемка Тогда
		Запись.МаксимальнаяСуммаРазмена = 0;
	КонецЕсли;
	
	УправлениеЭлементамиФормы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеЭлементамиФормы(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.МаксимальнаяСуммаРазмена.Доступность = Форма.АвтоматическаяВыемка;

КонецПроцедуры

#КонецОбласти
